# 1. what will be the output of the following python program ?
* a. Error
* b. None 
* c. False
* d. True

In [3]:
def foo (x):  #This defines a function named foo that takes a single parameter x.
    x[0]=['def']  #Inside the function, it modifies the contents of the list x.
    x[1]=['abc']   #It assigns a new list ['def'] to the 0th index and ['abc'] to the 1st index of the input list x.
    return id(x)  #Finally, it returns the unique identifier (id) of the modified list x.

In [4]:
q=['abc', 'def']  #A list q is initialized with the elements 'abc' and 'def'.
print(id(q)==foo(q)) #the comparison id(q) == foo(q) will evaluate to True.

True

# 2. what will be the output of the following python code ?Â¶
* a. error,there is more than one return statement in a single try finally block
* b. 1
* c. 1    2
* d. 2

In [5]:
def fun(): # This is a function named 'fun'.
    try:   # Inside a 'try' block, which means it's trying to do something.
        return 1  # It tries to return the value 1.
    finally: # No matter what happens in the 'try' block, this 'finally' block will run.
        return 2 # It returns the value 2.
k=fun()  ## Call the function 'fun' and store the result in a variable named 'k'.
print(k) # Print the value stored in 'k'.

2

# 3 ) what will be the output of the following code snippet ?
* a. Local
* b. Global
* c. None
* d. Cannot be predictable

In [7]:
def func(): # Define a function named 'func'
    global value  # Declare that 'value' inside the function is the global 'value'
    value = "Local"    # Set the global 'value' to "Local"
    
value = "Global"  # Set a global variable 'value' to "Global"
func() # Call the function 'func'
print(value) # Print the value of 'value' after calling the function

Local

# 4) ______expectations are raised as a result of an error in opening a particular file.

* a. Vlaue Error
* b. TypeError
* c. ImportError
* d. IOError

 correct option is 'IOError'

In [8]:
#Specifically deals with input/output operations, such as opening a file, and is raised when there's an issue with reading or writing to a file. In this case, if there's an error in opening a particular file, an IOError would be raised.

# 5 ) In python we do not specify types, it is directly interpreted by the compiler , so consider the following opeations to be performed.
* a. x= 13//2
* b. x= int(13/2)
* c. x=13%2
* d. all of the mentioned

correct option is ''all of the mentioned'

In [ ]:
# a. x = 13 // 2 gives 6 (sharing equally without remainder).
# b. x = int(13 / 2) gives 6 (taking only the whole part after division).
# c. x = 13 % 2 gives 1 (finding the remainder after division).
# So, the correct answer is: None of the mentioned (d).

# 6 ) what will be the output of the following python code
* a. index error
* b. name error
* c. value erro
* d. syntactical error

 correct option is 'name error'

In [9]:
t[5]

NameError: name 't' is not defined

# 7 ) A while loop in python is used for what type of iteration.
* a. indefinite
* b. discriminant
* c. definite
* d. indeterminate
 
 correct option is 'indefinite'

In [10]:
#Indefinite means you don't have a fixed or definite number of times you want to do something.
#A while loop is like a "keep doing this as long as a certain condition is true" instruction.

# 8 ) what will be the output of the following python code ?
* a. a b c d e
* b. abcde
* c. i i i i i i i
* d. Error

In [17]:
x = " abcde "
while i in x: 
    print(i,end=" ")
    
#The loop condition is not satisfied initially because there is no 'i' in the string " abcde ".
#Therefore, the loop doesn't execute, and nothing is printed.
#So, the correct option is: d. Error

NameError: name 'i' is not defined

# 9 ) what is the main advantages of using decorators in python ?
* a. They make the code more complex
* b. They simplify the syntax of the decorated.
* c. They reduce the performance of the code.
* d. They provide additional security features.

 correct option is 'They simplify the syntax of the decorated.'

In [22]:
# EIn Python, a decorator is like a sticker for functions. It adds extra features or modifications to a function without making the function itself too complicated. It makes your code look cleaner and more organized.

# So, the correct option is:b. They simplify the syntax of the decorated.

# 10 ) if return statement is not used inside the funciton,the funciton will return :
* a. None
* b. 0
* c. Null
* d. Arbitary Value

 correct option is 'None'

In [19]:
def foo():
    x=0
# So, if you don't tell the magic box what to give you, it will give you None.

# Therefore, the correct option is:a. None

# 11 ) what is called when a function is defined inside a class ?
* a. class
* b. function
* c. method
* d. module

 correct option is 'method'

In [21]:
# So, when you define a function inside a class, it becomes a special set of instructions that the class (robot) can follow. We call this special function inside a class a "method."

# Therefore, the correct option is: c. method

# 12 ) Which operator is used in python to import modules from packages ?
* a. .
* b. *
* c. ->
* d. &

 correct option is ' . '

In [23]:
# In Python, when you want to bring in a specific module from a package, you use a dot. It's like saying, "I want this particular toy from that big box."

# So, the correct option is: a. . (dot)

# 13.

In [27]:
def getMonth(m): # It's like creating a magical box (function) that can do something special with a number you give it.
    
    if m<1 or m>12: # It's like asking, "Is the number (month) less than 1 or greater than 12?"
        
        raise ValueError ("Invalid") #The function raises its hand and says, "Hey, this is not right! It's an invalid month!"
                                     #This is done using raise ValueError("Invalid").
            
    print(m) #It prints the month.

In [29]:
getMonth(6) #It's like telling the magical box, "Hey, check the number 6 for me!"
             #Since 6 is a valid month, it prints 6.

6

# 14 ) in the python programming language syntax error is detected by ___at ____
* a. Interpreter / Compile time
* b. Run time / interpreter
* c. interpreter / Run time
* d. Compile time / Run time

 correct option is 'interpreter / Run time'

In [30]:
# In the Python programming language, syntax errors are detected by the interpreter at compile time.

# 15 )
* a. both book1 and book2 will have refernece to two different of class Book
* b. id(book1) and id(book2) will have same value
* c. it will throw error as multiple reference to object is not possible
* d. None of the above
  
  correct option is ' id(book1) and id(book2) will have same value'

In [31]:
class Book:
    def __init__(self,author):
        self.author=author
book1=Book("V.M.Shah")
book2=book1

In [32]:
id(book1)

1405028442384

In [33]:
id(book2)

1405028442384

In [2]:
import pandas as pd , numpy as  np

In [3]:
data=pd.DataFrame({'date':['2024-01-01','2024-01-02','2024-01-03','2024-01-10','2024-01-9','2024-01-8'],
             'Category':['Beverage','Food','Beverage','Beverage','Beverage','Food'],
             'Product':['Cappuccino','Croissant','Espresso','Latte','Lattle','Muffin'],
             'Customer-Id':['C004','C002','C001','C001','C003','C002'],
             'Quantity':[1,2,2,3,1,1,],
             'UnitPrice':[3,2,2,3.5,3.5,2.5]}) 
data

         date  Category     Product Customer-Id  Quantity  UnitPrice
0  2024-01-01  Beverage  Cappuccino        C004         1        3.0
1  2024-01-02      Food   Croissant        C002         2        2.0
2  2024-01-03  Beverage    Espresso        C001         2        2.0
3  2024-01-10  Beverage       Latte        C001         3        3.5
4   2024-01-9  Beverage      Lattle        C003         1        3.5
5   2024-01-8      Food      Muffin        C002         1        2.5

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         6 non-null      object
 1   Category     6 non-null      object
 2   Product      6 non-null      object
 3   Customer-Id  6 non-null      object
 4   Quantity     6 non-null      int64
 5   UnitPrice    6 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 420.0+ bytes

In [5]:
x=pd.to_datetime(data['date'])

In [6]:
data['Date_column']=x

In [7]:
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08

# 16 ) How to create a new column 'Revenue' ,which has value equals to the quantity * unitprice of the current row
* a. df['Revenue'] = df['Quantity'] * df['UnitPrice']
* b. df['Revenue'] = df.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=1)
* c. df['Revenue'] = df.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=0)
* d. df['Revenue'] = df['Quantity'] ** df['UnitPrice']
   
   correct option is ' a&b'

In [8]:
data['Revenue']=data['Quantity'] * data['UnitPrice']
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02,4.0
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03,4.0
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10,10.5
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09,3.5
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

In [9]:
data['Revenue'] = data.apply(lambda x:x['Quantity'] * x['UnitPrice'],axis=1) 
## it multiplies the quantity and unitprice ,by taking axis as 1 ,axis=1 (row wise)

In [10]:
data

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
1,2024-01-02,Food,Croissant,C002,2,2.0,2024-01-02,4.0
2,2024-01-03,Beverage,Espresso,C001,2,2.0,2024-01-03,4.0
3,2024-01-10,Beverage,Latte,C001,3,3.5,2024-01-10,10.5
4,2024-01-9,Beverage,Lattle,C003,1,3.5,2024-01-09,3.5
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

# 17. what is the syntax to find categorical wise revenue ?
* a. df.groupby('Category')['Revenue'].mean()
* b. df.groupby('Category')['Revenue'].sum()
* c. df.groupby('Category')['Revenue'].agg(np.sum)
* d. df.groupby('Category')['Revenue'].agg('sum')
 
  correct option is 'b,c,d'

In [11]:
data.groupby('Category')['Revenue'].mean()  # its gives average

Category
Beverage    5.25
Food        3.25
Name: Revenue, dtype: float64

In [12]:
data.groupby('Category')['Revenue'].sum() # it finds the total sum ('sum') of revenue for each category.

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [13]:
data.groupby('Category')['Revenue'].agg(np.sum) # finding the sum, but it uses the agg function with np.sum (NumPy sum).

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [14]:
data.groupby('Category')['Revenue'].agg('sum') # data.groupby('Category')['Revenue'].agg('sum').the total sum of revenue for each category.

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

# 18. to find the average quantity wrt to date and product,what is the correct syntax ?(
* a. df.groupby(['Date','Product'])['Quantity'].avg()
* b. df.groupby(['Date','Product'])['Quantity'].mean()
* c. df.groupby(['Product','Date'])['Quantity'].avg()
* d. df.groupby(['Product','Mean'])['Quanity'].mean()
 
 correct option is 'b'

In [15]:
data.groupby(['Date_column','Product'])['Quantity'].mean() # This part is saying you want to group your data by both 'Date' and 'Product'.
                                                           # the average ('mean') quantity.

Date_column  Product
2024-01-01   Cappuccino    1.0
2024-01-02   Croissant     2.0
2024-01-03   Espresso      2.0
2024-01-08   Muffin        1.0
2024-01-09   Lattle        1.0
2024-01-10   Latte         3.0
Name: Quantity, dtype: float64

# 19 ) Categorical wise revenue for beverage and food respectively are
* a. 28.5,6.0
* b. 6.0,27.5
* c. 28.5,7.0
* d. 7.0,28.5

In [16]:
beverage_revenue = data[data['Category'] == 'Beverage']['Revenue'].sum()
food_revenue = data[data['Category'] == 'Food']['Revenue'].sum()
print("Beverage Revenue:", beverage_revenue)
print("Food Revenue:", food_revenue)

Beverage Revenue: 21.0
Food Revenue: 6.5

# 20 ) using transform what is the syntax to create a column which has a unitprice difference wrt its category mean ?
* a. df.groupby('Category')['UnitPrice'].transform(lambda x:x-x.mean())
* b. df.groupby('Category')('UnitPrice').transform(lambda x:x-x.mean())
* c. df.groupby['Category']['UnitPrice'].transform(lambda x:x-x.mean())
* c. df.groupby(['Category','UnitPrice']).transform(lambda x:x-x.mean())
  
  correct option is 'a'

In [17]:
data.groupby('Category')['UnitPrice'].transform(lambda x:x-x.mean())
# t's like saying, "For each product category, find the difference between its unit price and the average unit price for that category."

0    0.00
1   -0.25
2   -1.00
3    0.50
4    0.50
5    0.25
Name: UnitPrice, dtype: float64

# 21 ) what is the correct syntax to get data wrt 'Monday'.
* a. df.groupby(df.Date.dt.day_name()).get_groupby('Monday')
* b. df.groupby(df.Date.dt.dayname()).get_group('Monday')
* c. df.groupby(df.Date.dt.dayofweek()).get_groupby('Monday')
* d. df.groupby(df.Date.dt.day_of_week()).get_group('Monday')
 
    correct option is 'a'

In [18]:
data.groupby(data.Date_column.dt.day_name()).get_group('Monday')
# data by the day name (Monday, Tuesday, etc.) of the 'Date' column.
# group corresponding to 'Monday'. It's like saying, "Show me the data for Mondays."

,date,Category,Product,Customer-Id,Quantity,UnitPrice,Date_column,Revenue
0,2024-01-01,Beverage,Cappuccino,C004,1,3.0,2024-01-01,3.0
5,2024-01-8,Food,Muffin,C002,1,2.5,2024-01-08,2.5

# 22 ) which of the following statements is/are True ?
* a. apply() can be applied on rows
* b. apply function can't be applied on rows
* c. apply applies the function on the entire series at a time.
* d. apply apllies the function one cell at a time.
  
    correct option is 'a&c'

In [21]:
# apply() can be applied on both rows and columns. When you apply it to a DataFrame, you can specify the axis to indicate whether the function should be applied along rows (axis=0) or columns (axis=1).
# False. As mentioned in option (a), apply() can indeed be applied on rows.
# True. When you use apply() on a series, it applies the specified function to the entire series.
# False. This statement is not entirely accurate. When you use apply() on a DataFrame, it can apply the function either along rows or columns, not one cell at a time.

# apply() can be used on both rows and columns (a is true).
# apply() applies the function on the entire series at a time (c is true).

# 23 ) Which of the following statement is/are True ?
* a. Map applies the functionality on entire data Frame
* b. applymap applies the functionality on series be it row or a column
* c. apply and map are vectorized applications
* d. none of the above

 correct option is 'c'

In [ ]:
# False. map() is primarily used for substituting each value in a series with another value. It's not designed for the entire DataFrame but rather for a single series (column).

# False. applymap() is used for applying a function to every element in the entire DataFrame. It is not used on individual series (columns) but on the entire DataFrame.

# True. Both apply() and map() are considered vectorized operations. This means they can efficiently perform operations on entire series or columns without the need for explicit looping.

# False. At least one statement (c) is true.

In [23]:
df1=pd.DataFrame({'Date':['2024-01-10','2024-01-11','2024-01-10','2024-01-12','2024-01-11','2024-01-12'],
                 'Region':['North','South','East','West','North','East'],
                 'Salesperson':['Ajay','Balu','Chirag','Ajay','Balu','Chirag'],
                 'Product':['Notebook','Pen','Notebook','Pen','Binder','Binder'],
                 'Quantity':[5,10,7,15,20,10],
                 'Untprice':[12,3,12,3,5,5]})
df1

         Date Region Salesperson   Product  Quantity  Untprice
0  2024-01-10  North        Ajay  Notebook         5        12
1  2024-01-11  South        Balu       Pen        10         3
2  2024-01-10   East      Chirag  Notebook         7        12
3  2024-01-12   West        Ajay       Pen        15         3
4  2024-01-11  North        Balu    Binder        20         5
5  2024-01-12   East      Chirag    Binder        10         5

# 24 ) what is the syntax to create a pivot table with indedx as north and south and columns as product where values are sum of quantites sold ?
* a. df1[df1['Region'].isin(['North','South']).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
* b. df1[df1['Region'].isin(['North','South']).pivot_table(index='Product',columns='Product',values='Quantity',aggfun='sum')
* c. df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
* d. df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',aggfun='sum')

In [25]:
df1[df1['Region'].isin(['North','South'])].pivot_table(index='Region',columns='Product',values='Quantity',aggfunc='sum')

Product  Binder  Notebook   Pen
Region
North      20.0       5.0   NaN
South       NaN       NaN  10.0

In [26]:
#df1[df1['Region'].isin(['North','South'])].pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
## we dont have agg parameter in pivot_table 
 
#df1[(df1['Region']=='North')|(df1['Region']=='South')]).pivot_table(index='Product',columns='Product',values='Quantity',agg='sum')
## we dont have agg parameter in pivot_table 

#df1[(df1['Region']=='North')|(df1['Region']=='South')].pivot_table(index='Product',columns='Product',values='Quantity',aggfunc='sum')

# 25 ) which of the following statements is/are True ?
* a. .iloc method includes the last element when used for slicing
* b. .loc method doesnt includes the last element when used for slicing
* c. we can use .loc method and pass default integer index of rows when slicing
* d. None of the above 

  correct option is 'c'

In [28]:
# False. When using .iloc for slicing, it follows the Python convention of excluding the last element in the range. So, the last element is not included.

# False. Similar to .iloc, when using .loc for slicing, the last element is included in the range.

# True. You can use .loc and pass the default integer index of rows for slicing. This means you can slice the DataFrame using row indices.

# False. At least one statement (c) is true.

# 26 ) Using a pivot table is it possible to create a multi-index data frame,if so what is the syntax to have a multi index of Date and Region with total product sold as values
* a. no we can't create a multi-index table uisng pivot table
* b. df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',aggfunc='sum')
* c. df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',agg='sum')
* d. None of these

In [29]:
df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',aggfunc='sum') ## by using pivot_table we can create multiple indexes

Product            Binder  Notebook   Pen
Date       Region
2024-01-10 East       NaN       7.0   NaN
           North      NaN       5.0   NaN
2024-01-11 North     20.0       NaN   NaN
           South      NaN       NaN  10.0
2024-01-12 East      10.0       NaN   NaN
           West       NaN       NaN  15.0

# 27 ) what does the margins parameter in the pivot_table( ) function allow you to include in the pivot table ?
* a. additional margins and subtotals for rows and columns.
* b. a list of column names to exclude from the pivot table
* c. the number of rows and columns to skip at the bigginning of the pivot table
* d. the maximum number of rows and columns to display in the pivot table
 
 correct option is 'a'

In [ ]:
# a.True adds extra rows and columns with subtotals and totals.
# b. A list of column names to exclude from the pivot table: This is not the purpose of the margins parameter.
# c. The number of rows and columns to skip at the beginning of the pivot table: This is not the purpose of the margins parameter.
# d. The maximum number of rows and columns to display in the pivot table: This is not the purpose of the margins parameter.

In [32]:
df2 = pd.DataFrame({
    'Fruits': ['apple', 'banana', 'apple', 'apple', 'banana', 'apple', 'kiwi', 'kiwi', 'banana', 'apple', 'kiwi', 'apple', 'banana', 'grape', 'apple', 'banana', 'apple', 'apple', 'grape'],
    'Price': ['', '', 205, 200, 40, 210, 300, 320, '', 180, 350, '', 35, '', 215, 40, '', '', '']
})
df2

    Fruits Price
0    apple
1   banana
2    apple   205
3    apple   200
4   banana    40
5    apple   210
6     kiwi   300
7     kiwi   320
8   banana
9    apple   180
10    kiwi   350
11   apple
12  banana    35
13   grape
14   apple   215
15  banana    40
16   apple
17   apple
18   grape

# 28 ) if we choose to impute missing values in price col by chaining ffill() and bfill() while limiting the imputation to 1,1 respectively,how many missing values will be left post imputation ?
* a. 2
* b. 0
* c. 1
* d. 3

correct option is 'd'

In [33]:
df2['Price'] = pd.to_numeric(df2['Price'])
df2['Price'] = df2['Price'].ffill(limit=1).bfill(limit=1) ## ffill is forward filling,bfill backward fill 
df2 ## limit =1 is for it only fill one value in both ffill and bfill

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

# 29 ) what kind of missing values handling technique is appropriate for df2?
* a. imputing price col with Price's mean.
* b. impution price col with prices median.
* c. imputation price col with individuals fruits'prices median
* d. dropping missing values

  correct option is 'c''

In [34]:
df2

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

In [36]:
df2['Price'] = pd.to_numeric(df2['Price'])#converting to numeric
df2['Price'] = df2.groupby('Fruits')['Price'].transform(lambda x: x.fillna(x.mean()))
df2

    Fruits  Price
0    apple  200.0
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple  200.0
18   grape   35.0

# 30 ) if we choose to impute missing values in price col by with individual fruits prices mean how many missing values will be post imputatiion ?
* a. 2
* b. 0
* c. 1
* d. 3
 
 correct option is 'a'

In [ ]:
# If there were originally 2 missing values and they were successfully imputed, then option a. 2 missing values could be correct.

# 31. a= pd.Series ([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7])
## what will be the output of a.interpolate()

 correct option is 'c'

In [37]:
a= pd.Series ([np.nan,1,2,np.nan,np.nan,np.nan,np.nan,4,5,7])

In [38]:
a.interpolate()

0    NaN
1    1.0
2    2.0
3    2.4
4    2.8
5    3.2
6    3.6
7    4.0
8    5.0
9    7.0
dtype: float64

# 32 ) what is the use of the normalization parameter in the crosstab method pf pandas ?
* a. it is used to normalize values by dividing them by the total count
* b. to add margings
* c. there is no parameter called as normalize in crosstab.
* d. Both a&c

 correct option is 'a'

In [39]:
# b. To add margins: Adding margins is controlled by the margins parameter, not normalize.
# c. There is no parameter called as normalize in crosstab: This is not correct. The normalize parameter does exist in the crosstab method.
# a. It is used to normalize values by dividing them by the total count.

In [40]:
data = {
    'Age Group': ['26-35', '18-25', '18-25', '26-35', '18-25', '18-25'],
    'Favorite Color': ['Blue', 'Red', 'Red', 'Blue', 'Red', 'Blue'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female', 'Female'],
    'Has Pet': ['Yes', 'Yes', 'Yes', 'Yes', 'Yes', 'No']
}

df3 = pd.DataFrame(data)

print(df3)

  Age Group Favorite Color  Gender Has Pet
0     26-35           Blue    Male     Yes
1     18-25            Red  Female     Yes
2     18-25            Red    Male     Yes
3     26-35           Blue  Female     Yes
4     18-25            Red  Female     Yes
5     18-25           Blue  Female      No

# 33. What is the probabilty of finding a Male and having a Pet in df3
* a) 0.333
* b) 0.666
* c) 0.5
* d) 0.1667

 correct option is 'a'

In [43]:
total_observations = len(df3)
male_and_has_pet = len(df3[(df3['Gender'] == 'Male') & (df3['Has Pet'] == 'Yes')])
probability = male_and_has_pet / total_observations
probability

0.3333333333333333

# 34. What is the probabilty of finding a person having Pet given they belong to the age group 18-25 in df3
* a) 0.25
* b) 0
* c) 0.75
* d) 1
  
    correct option is 'c'

In [45]:
age_group_18_25 = len(df3[df3['Age Group'] == '18-25'])
has_pet_and_age_group_18_25 = len(df3[(df3['Age Group'] == '18-25') & (df3['Has Pet'] == 'Yes')])
probability = has_pet_and_age_group_18_25 / age_group_18_25

print(probability)

0.75

# 35. Which distribution is appropriate for modeling the number of defects in a large batch of products
* a) Normal
* b) Binomial
* c) Bernouli
* d) Uniform
 
    correct option is 'b'

In [47]:
# Binomial Distribution: This distribution is suitable for modeling the number of successes (defects, in this case) in a fixed number of independent and identical trials (products in a batch).

# 36. A survey asks participants to rate their satisfaction with product on a scale of 1 to 5 What type of data is being collected
* a) Categorical data
* b) Ordinal data
* c) Continuous data
* d) Discrete data
 
    correct option is 'b'

In [48]:
# Ordinal Data: Imagine you have toys of different sizes. Now, if you arrange them from smallest to largest, you can tell which one is bigger, but you can't say exactly how much bigger. Similarly, in ordinal data, you have categories, and you know the order between them, but the differences between the categories may not be uniform.

# 37. From given fig. in question , what kind of distribution does the data follow
* a) Right skewed
* b) Left skewed
* c) Normal
* d) Uniform

 correct option is 'a'

# 38. In data with outliers , what is the best measure to estimate the dispersion
* a) Standard Deviation
* b) Z-score
* c) Median Absolute Deviation
* d) Uniform
 
 correct option is 'c'

In [ ]:
# a) Standard Deviation: Standard deviation is sensitive to outliers. Outliers can greatly affect the mean, and since standard deviation is based on the mean, it may not be the best choice when dealing with data containing outliers.

# b) Z-score: Z-score is a measure of how far a data point is from the mean in terms of standard deviations. Since standard deviation is affected by outliers, Z-score may not be the best choice when there are outliers in the data.

# d) Uniform: Uniform is not a measure of dispersion. It refers to a distribution where all values have equal probability.

 correct option is:
# c) Median Absolute Deviation (MAD): Imagine you have a group of friends and you want to find the middle person. The median is like finding the friend in the middle.